Revit 2020 API
ElectricalEquipment Members
The ElectricalEquipment type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
 (Inherited from MEPModel.)
ConnectorManager
Retrieves the Connector Manager from this MEPModel.
 (Inherited from MEPModel.)
DistributionSystem
get or set the Distribution System for the Electrical Equipment.
ElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
 (Inherited from MEPModel.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace